# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу.
# Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами.
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

word = input('введите слово:    ').lower().split()

def rhyme (text):
    func = lambda x: sum(1 for i in x if i in 'аеёиоуыэюя')
    temp = func(text[0])
    if all([func(i) == temp for i in text]):
        return 'Парам пам-пам'
    return 'Пам парам'

print(rhyme(word))